/*
Условие задачи 021:
21. Напишите программу, где есть глобальная переменная x, локальная переменная x в функции и блочная переменная x внутри {}. Выведите все три значения и объясните, как работает область видимости.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 021\n");
    return 0;
}
