/*
Условие задачи 152:
152. Напишите программу, демонстрирующую использование указателей на функции в структуре.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 152\n");
    return 0;
}
