/*
Условие задачи 231:
231. Напишите функцию, которая принимает массив целых чисел и его длину, создаёт копию массива в динамической памяти и возвращает указатель на неё.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 231\n");
    return 0;
}
