/*
Условие задачи 183:
183. Определите структуру Rectangle, содержащую две точки (левый верхний и правый нижний угол). Реализуйте функцию, вычисляющую площадь прямоугольника.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 183\n");
    return 0;
}
