/*
Условие задачи 206:
206. Напишите функцию, принимающую указатель на функцию сравнения и массив, и возвращающую индекс минимального элемента.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 206\n");
    return 0;
}
