/*
Условие задачи 267:
267. Реализуйте простую утилиту типа cat на языке Cи.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 267\n");
    return 0;
}
