/*
Условие задачи 090:
90. Напишите программу, которая выводит числа от 1 до 100, которые делятся на 3 и 5 одновременно.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 090\n");
    return 0;
}
