/*
Условие задачи 314:
314. Создайте программу, которая выводит список всех переданных аргументов командной строки, по одному на строку.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 314\n");
    return 0;
}
