/*
Условие задачи 269:
269. Напишите функцию, устанавливающую определённый бит в числе.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 269\n");
    return 0;
}
