/*
Условие задачи 091:
91. Создайте программу, которая выводит на экран квадраты чисел от 1 до 10.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 091\n");
    return 0;
}
