/*
Условие задачи 187:
187. Напишите программу, которая демонстрирует влияние порядка полей на размер структуры.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 187\n");
    return 0;
}
