/*
Условие задачи 286:
286. Напишите функцию, принимающую строку и возвращающую её длину.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 286\n");
    return 0;
}
