/*
Условие задачи 031:
31. Вычислите площадь круга с радиусом 5 (тип float).
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 031\n");
    return 0;
}
