/*
Условие задачи 299:
299. Создайте статическую (static) функцию и попробуйте вызвать её из другого файла.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 299\n");
    return 0;
}
