/*
Условие задачи 263:
263. Напишите программу, которая объединяет несколько текстовых файлов в один.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 263\n");
    return 0;
}
