/*
Условие задачи 104:
104. Напишите программу, которая запрашивает у пользователя положительное число и выводит его цифры в обратном порядке.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 104\n");
    return 0;
}
