/*
Условие задачи 284:
284. Напишите функцию для поиска НОД двух чисел.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 284\n");
    return 0;
}
