/*
Условие задачи 109:
109. Напишите программу, которая выводит все числа Фибоначчи меньше заданного значения N.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 109\n");
    return 0;
}
