/*
Условие задачи 093:
93. Реализуйте программу, которая выводит все делители заданного числа N.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 093\n");
    return 0;
}
