/*
Условие задачи 192:
192. Реализуйте безопасный макрос SWAP(a, b, type) для обмена значений.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 192\n");
    return 0;
}
