/*
Условие задачи 115:
115. Напишите программу, которая запрашивает у пользователя число и выводит его цифры по одной, начиная с последней.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 115\n");
    return 0;
}
