/*
Условие задачи 234:
234. Напишите программу, которая создает массив указателей на целые числа, заполняет их значениями и корректно освобождает всю выделенную память.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 234\n");
    return 0;
}
