/*
Условие задачи 041:
41. Выведите ASCII-код символа.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 041\n");
    return 0;
}
