/*
Условие задачи 301:
301. Напишите программу, показывающую, как static влияет на переменную в цикле.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 301\n");
    return 0;
}
