/*
Условие задачи 208:
208. Напишите программу, демонстрирующую использование указателей на функции в структуре.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 208\n");
    return 0;
}
