/*
Условие задачи 062:
62. Реализуйте проверку на возрастание трёх чисел.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 062\n");
    return 0;
}
