/*
Условие задачи 239:
239. Напишите программу, которая выделяет память под буфер фиксированного размера, считывает данные из стандартного ввода и сохраняет их в этот буфер с возможностью динамического расширения.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 239\n");
    return 0;
}
