/*
Условие задачи 066:
66. Выведите таблицу умножения с использованием вложенных циклов.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 066\n");
    return 0;
}
