/*
Условие задачи 258:
258. Напишите программу, которая считает количество слов в файле.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 258\n");
    return 0;
}
