/*
Условие задачи 306:
306. Напишите программу, которая принимает имя пользователя как аргумент командной строки и выводит приветственное сообщение: "Привет, <имя>!".
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 306\n");
    return 0;
}
