/*
Условие задачи 138:
138. Реализуйте функцию void reverse_array(int *arr, int n), которая переворачивает массив на месте с использованием указателей.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 138\n");
    return 0;
}
