/*
Условие задачи 135:
135. Напишите функцию, вычисляющую факториал числа.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 135\n");
    return 0;
}
