/*
Условие задачи 191:
191. Напишите макрос MAX(a, b), возвращающий большее из двух чисел.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 191\n");
    return 0;
}
