/*
Условие задачи 019:
19. Создайте переменную типа const int со значением 100. Попробуйте изменить её значение внутри программы. Опишите, что произойдёт при компиляции.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 019\n");
    return 0;
}
