/*
Условие задачи 084:
84. Напишите программу, которая принимает день недели (число от 1 до 7) и выводит, является ли этот день рабочим или выходным. Используйте switch.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 084\n");
    return 0;
}
