/*
Условие задачи 323:
323. Напишите программу, которая читает CSV-файл и выводит его содержимое в табличном виде.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 323\n");
    return 0;
}
