/*
Условие задачи 169:
169. Напишите программу, демонстрирующую работу адресной арифметики.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 169\n");
    return 0;
}
