/*
Условие задачи 174:
174. Реализуйте указатель на массив.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 174\n");
    return 0;
}
