/*
Условие задачи 096:
96. Напишите программу, которая выводит на экран числа от 1 до N, заменяя те, что делятся на 3 — "Fizz", на 5 — "Buzz", на оба — "FizzBuzz".
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 096\n");
    return 0;
}
