/*
Условие задачи 097:
97. Напишите программу, которая находит максимальный делитель двух чисел (НОД) с помощью цикла for.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 097\n");
    return 0;
}
