/*
Условие задачи 277:
277. Создайте маску из диапазона битов и примените её к числу.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 277\n");
    return 0;
}
