/*
Условие задачи 332:
332. Напишите программу, которая шифрует и дешифрует текст с помощью шифра Цезаря (сдвиг букв на N позиций).
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 332\n");
    return 0;
}
