/*
Условие задачи 057:
57. Реализуйте проверку истинности условия: число положительное и нечетное.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 057\n");
    return 0;
}
