/*
Условие задачи 126:
126. Напишите программу, которая считает количество слов в файле.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 126\n");
    return 0;
}
