/*
Условие задачи 268:
268. Напишите программу, которая копирует файл побайтово.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 268\n");
    return 0;
}
