/*
Условие задачи 085:
85. Реализуйте простое меню с выбором действия (1 — сложение, 2 — вычитание, 3 — умножение, 4 — деление). Выполните выбранную операцию над двумя числами, используя switch. Обработайте случай неверного ввода.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 085\n");
    return 0;
}
