/*
Условие задачи 264:
264. Реализуйте простой редактор записей (например, список контактов), сохраняющий данные в файл.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 264\n");
    return 0;
}
