/*
Условие задачи 139:
139. Напишите функцию, которая находит максимальное значение в массиве с помощью указателей.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 139\n");
    return 0;
}
