/*
Условие задачи 082:
82. Создайте программу, которая определяет, является ли введённый год високосным. Для этого: Год делится на 4 → високосный, но если он делится на 100, но не делится на 400 → не високосный.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 082\n");
    return 0;
}
