/*
Условие задачи 233:
233. Напишите программу, которая загружает текстовый файл в динамический массив строк и выводит его содержимое на экран.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 233\n");
    return 0;
}
