/*
Условие задачи 068:
68. Напишите программу, находящую все простые числа до N.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 068\n");
    return 0;
}
