/*
Условие задачи 333:
333. Создайте функцию, которая принимает массив целых чисел и возвращает указатель на динамически выделенный массив, содержащий только уникальные значения.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 333\n");
    return 0;
}
