/*
Условие задачи 313:
313. Напишите программу, которая принимает два числа и операцию (+, -, *, /) как аргументы и выполняет соответствующее математическое действие.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 313\n");
    return 0;
}
