/*
Условие задачи 281:
281. Напишите программу, которая определяет, является ли число степенью двойки, используя битовые операции.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 281\n");
    return 0;
}
