/*
Условие задачи 207:
207. Создайте массив указателей на функции, реализующих разные математические операции, и вызовите каждую из них.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 207\n");
    return 0;
}
