/*
Условие задачи 318:
318. Создайте функцию, которая возвращает указатель на строку, представляющую число в произвольной системе счисления (основание от 2 до 16).
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 318\n");
    return 0;
}
