/*
Условие задачи 039:
39. Напишите программу, которая считывает символ с клавиатуры и выводит его.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 039\n");
    return 0;
}
