/*
Условие задачи 052:
52. Напишите функцию, которая разбивает строку на слова и сохраняет их в массив указателей.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 052\n");
    return 0;
}
