/*
Условие задачи 305:
305. Напишите программу, сравнивающую производительность malloc и calloc.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 305\n");
    return 0;
}
