/*
Условие задачи 088:
88. Напишите программу, которая вычисляет сумму всех целых чисел от 1 до N с использованием цикла for.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 088\n");
    return 0;
}
