/*
Условие задачи 172:
172. Напишите функцию, принимающую указатель на массив и изменяющую его.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 172\n");
    return 0;
}
