/*
Условие задачи 053:
53. Создайте программу, которая считывает строку и выводит только те слова, которые начинаются с заглавной буквы.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 053\n");
    return 0;
}
