/*
Условие задачи 164:
164. Напишите программу, которая заполняет массив случайными числами и выводит только уникальные элементы.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 164\n");
    return 0;
}
