/*
Условие задачи 315:
315. Напишите программу, которая поддерживает флаги `--help` и `--version`. При наличии этих флагов программа должна выводить соответствующую информацию.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 315\n");
    return 0;
}
