/*
Условие задачи 241:
241. Напишите программу, которая выделяет память под строку, запрашивает у пользователя текст, записывает его в строку и после завершения освобождает память.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 241\n");
    return 0;
}
