/*
Условие задачи 116:
116. Реализуйте программу, которая вычисляет среднее арифметическое последовательности положительных чисел, вводимых до тех пор, пока не будет введено отрицательное число.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 116\n");
    return 0;
}
