/*
Условие задачи 245:
245. Напишите программу, которая использует инструменты valgrind для проверки утечек памяти при работе с динамически выделенными массивами.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 245\n");
    return 0;
}
