/*
Условие задачи 326:
326. Напишите программу, которая находит наиболее часто встречающийся элемент в массиве целых чисел.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 326\n");
    return 0;
}
