/*
Условие задачи 130:
130. Напишите программу, которая считывает содержимое текстового файла и выводит его на экран построчно.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 130\n");
    return 0;
}
