/*
Условие задачи 083:
83. Напишите программу, которая определяет, равны ли три введённых числа. Выведите "Все равны", "Два равны" или "Все разные", используя if-else.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 083\n");
    return 0;
}
