/*
Условие задачи 175:
175. Определите структуру Student с полями имя, возраст, оценка.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 175\n");
    return 0;
}
