/*
Условие задачи 043:
43. Напишите программу, выводящую таблицу ASCII-символов.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 043\n");
    return 0;
}
