/*
Условие задачи 119:
119. Реализуйте программу, которая выводит на экран сумму первых N натуральных чисел, которые делятся на 3 или на 5.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 119\n");
    return 0;
}
