/*
Условие задачи 153:
153. Напишите программу, заполняющую массив числами от 1 до N.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 153\n");
    return 0;
}
