/*
Условие задачи 063:
63. Напишите цикл for, выводящий числа от 1 до 10.
*/

#include <stdio.h>

int main() {
    for (int i = 1; i <= 10; i++) {
        printf("%d\n", i);
    }
    return 0;
}
