/*
Условие задачи 063:
63. Напишите цикл for, выводящий числа от 1 до 10.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 063\n");
    return 0;
}
