/*
Условие задачи 242:
242. Напишите программу, которая читает несколько строк текста, хранит их в динамическом массиве и выводит в обратном порядке.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 242\n");
    return 0;
}
