/*
Условие задачи 322:
322. Реализуйте макрос, который проверяет, находится ли заданное значение внутри заданного диапазона [min; max].
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 322\n");
    return 0;
}
