/*
Условие задачи 235:
235. Напишите программу, которая реализует простой список имён, используя динамическое выделение памяти под каждую строку, и позволяет пользователю добавлять новые имена.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 235\n");
    return 0;
}
