/*
Условие задачи 243:
243. Напишите функцию, которая принимает две строки, объединяет их в новую строку в динамической памяти и возвращает указатель на результат.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 243\n");
    return 0;
}
