/*
Условие задачи 155:
155. Вычислите среднее значение элементов массива.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 155\n");
    return 0;
}
