/*
Условие задачи 240:
240. Напишите программу, которая создаёт очередь (FIFO) с использованием динамического массива и реализует операции добавления и удаления элементов.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 240\n");
    return 0;
}
