/*
Условие задачи 304:
304. Реализуйте очередь на основе связного списка.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 304\n");
    return 0;
}
