/*
Условие задачи 166:
166. Напишите программу, которая проверяет, является ли массив палиндромом.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 166\n");
    return 0;
}
