/*
Условие задачи 253:
253. Напишите Makefile, поддерживающий цели build, test, clean, run.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 253\n");
    return 0;
}
