/*
Условие задачи 190:
190. Напишите программу, которая создаёт массив структур Student и сортирует его по среднему баллу.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 190\n");
    return 0;
}
