/*
Условие задачи 320:
320. Напишите программу, которая шифрует и дешифрует текст с помощью шифра Цезаря (сдвиг букв на N позиций).
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 320\n");
    return 0;
}
