/*
Условие задачи 201:
201. Напишите макрос, принимающий переменное количество аргументов (...).
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 201\n");
    return 0;
}
