/*
Условие задачи 229:
229. Напишите программу, которая создаёт двумерный массив (матрицу) размером MxN с использованием динамического выделения памяти и выводит его содержимое.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 229\n");
    return 0;
}
