/*
Условие задачи 195:
195. Напишите макрос PRINT_SIZE(type), который выводит размер указанного типа.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 195\n");
    return 0;
}
