/*
Условие задачи 087:
87. Напишите программу, возвращающую разные коды ошибок.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 087\n");
    return 0;
}
