/*
Условие задачи 205:
205. Реализуйте простой калькулятор с меню, используя указатели на функции для операций сложения, вычитания, умножения и деления.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 205\n");
    return 0;
}
