/*
Условие задачи 113:
113. Напишите программу, которая находит сумму всех двузначных чисел, кратных 3.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 113\n");
    return 0;
}
