/*
Условие задачи 159:
159. Напишите программу, находящую минимальное и максимальное значение.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 159\n");
    return 0;
}
