/*
Условие задачи 001:
1. Напишите простую программу "Hello World" на языке C.
*/

#include <stdio.h>  
int main () {
    printf("Hello World!\n");
    return 0;
}
