/*
Условие задачи 307:
307. Напишите программу, которая принимает несколько целых чисел в качестве аргументов и вычисляет их сумму.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 307\n");
    return 0;
}
