/*
Условие задачи 177:
177. Напишите функцию, изменяющую поле структуры через указатель.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 177\n");
    return 0;
}
