/*
Условие задачи 248:
248. Напишите простой Makefile для автоматизации сборки.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 248\n");
    return 0;
}
