// Задача 248 Напишите простой Makefile для автоматизации сборки. 
#include <stdio.h>

int main() {
    printf("Решение задачи 248\n");
    return 0;
}
//Makefile
// all:
//   gcc main.c -o res
