/*
Условие задачи 094:
94. Напишите программу, которая считает сумму квадратов первых N натуральных чисел.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 094\n");
    return 0;
}
