/*
Условие задачи 027:
27. Выведите результат выражения (a + b) * c / d.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 027\n");
    return 0;
}
