/*
Условие задачи 137:
137. Напишите функцию void swap(int *a, int *b), которая меняет местами значения двух переменных через указатели.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 137\n");
    return 0;
}
