/*
Условие задачи 273:
273. Напишите функцию, которая меняет местами два бита в числе.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 273\n");
    return 0;
}
