/*
Условие задачи 325:
325. Реализуйте функцию, которая возвращает указатель на структуру, содержащую результаты анализа массива (минимум, максимум, среднее значение).
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 325\n");
    return 0;
}
