/*
Условие задачи 028:
28. Найдите остаток от деления с помощью %.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 028\n");
    return 0;
}
