/*
Условие задачи 181:
181. Создайте структуру Point с полями x и y. Напишите функцию, вычисляющую расстояние между двумя точками.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 181\n");
    return 0;
}
