/*
Условие задачи 311:
311. Напишите программу, которая принимает число из аргумента командной строки и вычисляет его факториал.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 311\n");
    return 0;
}
