/*
Условие задачи 237:
237. Напишите программу, которая создаёт массив структур Student (имя, оценка) с динамическим выделением памяти и выводит данные на экран.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 237\n");
    return 0;
}
