/*
Условие задачи 029:
29. Напишите программу, использующую побитовый сдвиг как замену умножению.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 029\n");
    return 0;
}
