/*
Условие задачи 108:
108. Создайте программу, которая подсчитывает сумму только чётных чисел, введённых пользователем. Программа завершается при вводе 0.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 108\n");
    return 0;
}
