/*
Условие задачи 226:
226. Напишите программу, которая выделяет массив из 10 целых чисел с помощью malloc, заполняет его числами от 1 до 10 и выводит на экран.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 226\n");
    return 0;
}
