/*
Условие задачи 099:
99. Напишите программу, которая проверяет, является ли число совершенным (равным сумме своих делителей, кроме самого себя).
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 099\n");
    return 0;
}
