/*
Условие задачи 034:
34. Напишите программу, демонстрирующую потерю точности при сложении дробей.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 034\n");
    return 0;
}
