/*
Условие задачи 026:
26. Напишите функцию, в которой объявите несколько переменных без явного указания типа, используя auto. Убедитесь, что код компилируется с флагом -std=c11.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 026\n");
    return 0;
}
