/*
Условие задачи 048:
48. Напишите собственную реализацию функции strlen().
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 048\n");
    return 0;
}
