/*
Условие задачи 017:
17. Напишите программу, в которой вы создаёте псевдоним типа int под названием MyInt с помощью typedef. Объявите переменную этого типа, присвойте ей значение и выведите его на экран.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 017\n");
    return 0;
}
