/*
Условие задачи 081:
81. Напишите программу, которая принимает номер месяца (от 1 до 12) и выводит название этого месяца (например, 3 → "Март"). Используйте switch.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 081\n");
    return 0;
}
