/*
Условие задачи 045:
45. Напишите программу, меняющую регистр букв в строке.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 045\n");
    return 0;
}
