/*
Условие задачи 131:
131. Реализуйте простой аналог утилиты grep – программа должна искать строки, содержащие заданную подстроку, и выводить их.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 131\n");
    return 0;
}
