/*
Условие задачи 283:
283. Напишите программу, которая инвертирует все биты числа.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 283\n");
    return 0;
}
