/*
Условие задачи 303:
303. Напишите программу, реализующую стек на основе массива.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 303\n");
    return 0;
}
