/*
Условие задачи 049:
49. Напишите функцию, которая заменяет все пробелы в строке на символ _.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 049\n");
    return 0;
}
