/*
Условие задачи 238:
238. Напишите программу, которая создаёт одномерный массив с помощью calloc, выводит его содержимое и объясняет разницу между calloc и malloc.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 238\n");
    return 0;
}
