/*
Условие задачи 232:
232. Напишите программу, которая выделяет память под массив строк, запрашивает у пользователя количество строк и сами строки, затем выводит их обратно.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 232\n");
    return 0;
}
