/*
Условие задачи 189:
189. Напишите функцию, которая сравнивает две структуры Person по имени и возрасту.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 189\n");
    return 0;
}
