/*
Условие задачи 279:
279. Напишите функцию, которая устанавливает N младших битов числа в 1.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 279\n");
    return 0;
}
