/*
Условие задачи 170:
170. Выведите значение переменной и её адрес с помощью указателя.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 170\n");
    return 0;
}
