/*
Условие задачи 117:
117. Создайте программу, которая выводит на экран все совершенные числа в диапазоне от 2 до N. Совершенное число — это число, равное сумме своих делителей, кроме самого себя.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 117\n");
    return 0;
}
