/*
Условие задачи 100:
100. Создайте программу, которая выводит на экран таблицу значений функции y = 2x + 3 для x от -5 до 5.
*/

#include <stdio.h>

int main() {
    printf("x\t|\ty = 2x + 3\n");
    printf("-----------------------\n");
    for (int x = -5; x <= 5; x++) {
        int y = 2 * x + 3;
        printf("%d\t|\t%d\n", x, y);
    }
    return 0;
}
