/*
Условие задачи 100:
100. Создайте программу, которая выводит на экран таблицу значений функции y = 2x + 3 для x от -5 до 5.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 100\n");
    return 0;
}
