/*
Условие задачи 244:
244. Напишите программу, которая создаёт массив целых чисел, фильтрует его (например, оставляет только чётные), и возвращает новый массив в динамической памяти.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 244\n");
    return 0;
}
