/*
Условие задачи 118:
118. Напишите программу, которая определяет, является ли введённое число степенью двойки, используя цикл while.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 118\n");
    return 0;
}
