/*
Условие задачи 154:
154. Найдите максимальный элемент в массиве.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 154\n");
    return 0;
}
