/*
Условие задачи 194:
194. Определите макрос, который выводит отладочную информацию только при определённом флаге.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 194\n");
    return 0;
}
