/*
Условие задачи 168:
168. Напишите функцию, которая объединяет два отсортированных массива в один отсортированный.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 168\n");
    return 0;
}
