/*
Условие задачи 185:
185. Определите структуру Employee с полями: имя, должность, зарплата. Напишите функцию, которая выводит данные сотрудника.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 185\n");
    return 0;
}
