/*
Условие задачи 199:
199. Напишите макрос CONTAINER_OF(ptr, type, member), возвращающий указатель на структуру по адресу одного из её полей.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 199\n");
    return 0;
}
