/*
Условие задачи 020:
20. Определите перечисление Color, содержащее значения RED, GREEN, BLUE. Объявите переменную этого типа, присвойте ей значение и выведите на экран.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 020\n");
    return 0;
}
