/*
Условие задачи 309:
309. Напишите программу, которая подсчитывает количество переданных аргументов командной строки (включая имя программы).
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 309\n");
    return 0;
}
