/*
Условие задачи 098:
98. Реализуйте программу, которая выводит на экран треугольник из звёздочек высотой N (по строкам: 1 звёздочка в первой строке, 2 — во второй и т.д.).
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 098\n");
    return 0;
}
