/*
Условие задачи 291:
291. Напишите функцию, объединяющую две строки.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 291\n");
    return 0;
}
