/*
Условие задачи 297:
297. Напишите программу, демонстрирующую использование register переменной.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 297\n");
    return 0;
}
