/*
Условие задачи 288:
288. Напишите функцию, возвращающую индекс первого вхождения символа в строке.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 288\n");
    return 0;
}
