/*
Условие задачи 111:
111. Напишите программу, которая запрашивает у пользователя пароль и продолжает запрашивать его, пока введённое значение не совпадёт с правильным.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 111\n");
    return 0;
}
