/*
Условие задачи 327:
327. Создайте функцию, которая заменяет все вхождения одной подстроки в строке на другую подстроку.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 327\n");
    return 0;
}
