/*
Условие задачи 060:
60. Напишите программу, проверяющую, является ли число простым.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 060\n");
    return 0;
}
