/*
Условие задачи 106:
106. Напишите программу, которая вычисляет факториал числа N с использованием цикла while.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 106\n");
    return 0;
}
