/*
Условие задачи 266:
266. Напишите функцию, которая добавляет новую запись в конец существующего файла.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 266\n");
    return 0;
}
