/*
Условие задачи 298:
298. Напишите программу, демонстрирующую работу inline функции.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 298\n");
    return 0;
}
