/*
Условие задачи 151:
151. Создайте массив указателей на функции, реализующих разные математические операции, и вызовите каждую из них.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 151\n");
    return 0;
}
