/*
Условие задачи 230:
230. Напишите программу, которая выделяет память для структуры Person (поля: имя, возраст), заполняет её данными и выводит на экран.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 230\n");
    return 0;
}
