/*
Условие задачи 051:
51. Напишите программу, которая преобразует строку в верхний регистр без использования стандартной библиотеки.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 051\n");
    return 0;
}
