/*
Условие задачи 236:
236. Напишите функцию, которая принимает массив целых чисел и его длину, увеличивает его размер на 10 элементов с помощью realloc и дополняет нулями.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 236\n");
    return 0;
}
