/*
Условие задачи 162:
162. Напишите программу, создающую двумерный массив.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 162\n");
    return 0;
}
