/*
Условие задачи 092:
92. Напишите программу, которая подсчитывает количество нечётных чисел в диапазоне от 1 до N.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 092\n");
    return 0;
}
