/*
Условие задачи 002:
2. Создайте свой заголовочный файл .h и подключите его.
*/

#include "header.h"
int main(){
    print_hello_world();
    return 0;
}
void print_hello_world(){
    printf("Hello World!\n");
}
