/*
Условие задачи 101:
101. Реализуйте программу, которая выводит все двузначные числа, сумма цифр которых равна заданному числу K.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 101\n");
    return 0;
}
