/*
Условие задачи 054:
54. Напишите программу, проверяющую, является ли число четным.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 054\n");
    return 0;
}
