/*
Условие задачи 228:
228. Реализуйте функцию, которая принимает строку, создаёт её копию в динамической памяти и возвращает указатель на эту копию.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 228\n");
    return 0;
}
