/*
Условие задачи 204:
204. Напишите программу, которая принимает указатель на математическую функцию (int func(int x)) и строит таблицу значений этой функции на заданном интервале.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 204\n");
    return 0;
}
