/*
Условие задачи 317:
317. Напишите программу, которая реализует циклический буфер (кольцевой буфер) с использованием динамического массива.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 317\n");
    return 0;
}
