/*
Условие задачи 329:
329. Напишите программу, которая реализует циклический буфер (кольцевой буфер) с использованием динамического массива.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 329\n");
    return 0;
}
