/*
Условие задачи 013:
13. Вычислите сумму двух целых чисел.
*/

#include <stdio.h>

int main() {
    int a = 5, b = 7;
    int sum = a + b;
    printf("Сумма: %d + %d = %d\n", a, b, sum);
    return 0;
}
