/*
Условие задачи 013:
13. Вычислите сумму двух целых чисел.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 013\n");
    return 0;
}
