/*
Условие задачи 289:
289. Напишите функцию, возвращающую количество гласных в строке.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 289\n");
    return 0;
}
