/*
Условие задачи 197:
197. Напишите макрос SWAP_T(T, a, b), безопасно меняющий значения переменных любого типа.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 197\n");
    return 0;
}
