/*
Условие задачи 050:
50. Реализуйте функцию, которая удаляет все гласные из строки.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 050\n");
    return 0;
}
