/*
Условие задачи 132:
132. Напишите программу, которая считывает файл и записывает все слова в другой файл в обратном порядке.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 132\n");
    return 0;
}
