/*
Условие задачи 134:
134. Напишите программу, которая подсчитывает количество слов, строк и символов в текстовом файле.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 134\n");
    return 0;
}
