/*
Условие задачи 321:
321. Создайте функцию, которая принимает массив целых чисел и возвращает указатель на динамически выделенный массив, содержащий только уникальные значения.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    printf("Solution for task 321\n");
    return 0;
}
